Labs/Lab2/lab2.tex
% Created 2015-03-19 Thu 18:28
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\usepackage{hyperref}
\usepackage{setspace}
\usepackage[labelfont=bf]{caption}
\usepackage{amsmath}
\usepackage{enumerate}
\usepackage[parfill]{parskip}
\author{Prateek Mehta, William F. Schneider}
\date{02-05-2015 Thu}
\title{Computational Chemistry Laboratory II (CBE 60547)}
\begin{document}

\maketitle

\section{Electronic Structure Calculations using \texttt{GAMESS} and \texttt{Avogadro}}
\label{sec-1}

In this lab session we will learn how to run and visualize the results of electronic structure calculations utilizing the GAMESS and Avogadro software on the CRC machines.

\subsection{Logging In}
\label{sec-1-1}

You should all be familiar with how to login to the CRC front end machine.

\begin{itemize}
\item Windows users using putty, open it and login.

\item For Mac and Linux users, and for windows users using MobaXterm,
\end{itemize}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{sh}
ssh -Y yournetid@crcfe01.crc.nd.edu
\end{minted}

\subsection{Loading the required modules}
\label{sec-1-2}

\begin{itemize}
\item The shell command \verb~module avail~ shows a list of software installed on the CRC machines which you can load and use
\end{itemize}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{sh}
module avail
\end{minted}


\begin{itemize}
\item The modules we will need to load are \verb~avogadro~, \verb~gamess~, and \verb~openbabel~.
\end{itemize}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{sh}
module load avogadro
module load gamess
module load openbabel
\end{minted}

\subsection{Avogadro}
\label{sec-1-3}

\begin{itemize}
\item To launch avogadro type
\end{itemize}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{sh}
avogadro &
\end{minted}

\begin{itemize}
\item We are going to set up and run a calculation for N$_{\text{2}}$

\item In the draw settings section select nitrogen from the element drop down menu

\item Uncheck adjust hydrogens (this will put hydrogens on your atom and construct NH$_{\text{3}}$)

\item Clicking in the view window will create a nitrogen atom

\item Place two nitrogen atoms next to each other to make a N$_{\text{2}}$ molecule

\item Hovering over any of the icons in the top bar will display a description of that option.

\item The click to measure tool will allow you to measure distances (select two atoms) and angles (select 3 atoms). Select both nitrogens, \#1 and \#2 will appear on them and the distance will be displayed below

\item Click on the manipulation tool (the hand with a finger pointing)

\item Click and drag one of the nitrogens until the bond length is 1.1 ˚A (later we will learn methods for optimizing geometry, but for right now we will set it based on the experimental distance \url{http://cccbdb.nist.gov/exp2.asp?casno=7727379})
\end{itemize}

\subsection{\texttt{GAMESS}}
\label{sec-1-4}

\subsubsection{Creating Input files}
\label{sec-1-4-1}

\begin{itemize}
\item We are ready to generate our input file now. From the extensions menu select \texttt{GAMESS} and click on \texttt{Input Generator}

\item A window will pop-up. The setup for this calculation right now is a single point energy calculation, the method is restricted Hartree-Fock, with the STO-3G basis. In the lower right click generate

\item Name your input file and save it in a new folder

\item Alternately, you could also have typed in the input file by hand
\end{itemize}

\subsubsection{Running calculations}
\label{sec-1-4-2}

\begin{itemize}
\item Go back to the terminal cd into the directory where you saved the input file

\item The command below will run games on your input file and generate an output file called \texttt{N2.log}
\end{itemize}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{sh}
rungms N2.inp > N2.log
\end{minted}



\subsubsection{Analyzing the output}
\label{sec-1-4-3}

\begin{itemize}
\item Open the output file in a text editor
\end{itemize}

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{sh}
emacs N2.log &
\end{minted}

\begin{itemize}
\item The structure of the output file is
\begin{itemize}
\item summary of the input
\item initialization messages
\item store 1 and 2 electron integrals
\item SCF calculation details
\item final orbital populations and energies
\end{itemize}

\item Now go back to Avogadro and open the log file

\item From here you can view the orbitals and their energies

\item You can also measure any angles and bond lengths in the same manner as we did when setting up the input calculation
\end{itemize}
% Emacs 24.4.3 (Org mode 8.2.10)
\end{document}